cf_billing/Documents/бестУстановитьНагрузкуПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьНагрузкуПоУслугам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестНагрузкаПоУслугамНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Нагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нагрузка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНагрузки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестВидыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НагрузкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНагрузкиДо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестВидыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктивностьТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктивностьТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестУслугиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУслугиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНагрузкаПоУслугамНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНагрузкаПоУслугамНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыПериодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестУстановитьНагрузкуПоУслугам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьНагрузкуПоУслугам(ЭтотОбъект, Объект.Ссылка);
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
		Если Не ЗначениеЗаполнено(Объект.Нагрузки) Тогда 
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Табличная часть не заполнена");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура НагрузкаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(Объект.Дата,Объект.Организация,Объект.Район, Объект.ОбъектРасчета);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(Период,Организация,Район,ОбъектРасчета)
	
	Результат = бестРаботаСОбъектамиНПСервер.ДействующиеУслугиПоОбъекту(Период,Организация,Район,ОбъектРасчета); 
	

	МассивУслуг = Результат.Выгрузить().ВыгрузитьКолонку("Услуга");
	
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого Стр Из МассивУслуг Цикл
		СписокУслуг.Добавить(Стр);
	КонецЦикла;
	// Макшанцев Был поправлен запрос в общем модуле. Резальтут приходит уже с простымии услугами
	//////Запрос = Новый Запрос;
	//////Запрос.Текст = 
	//////"ВЫБРАТЬ
	//////|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	//////|ИЗ
	//////|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	//////|ГДЕ
	//////|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	//////
	//////Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	//////
	//////РезультатЗапроса = Запрос.Выполнить();
	//////
	//////ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//////
	//////Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//////	СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	//////КонецЦикла;
	//Макшанцев
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Район, "Организация");
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(ТекОбъект, ИмяРеквизита)
	Возврат ТекОбъект[ИмяРеквизита];	
КонецФункции


&НаКлиенте
Процедура НагрузкаУслугаПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка.ТекущиеДанные;
	НагрузкаУслугаПриИзмененииКлиент(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура НагрузкаУслугаПриИзмененииКлиент(ТекДанные)
	Услуга = ТекДанные.Услуга;
	НомерСтроки = ТекДанные.НомерСтроки;	
	НагрузкаУслугаПриИзмененииНаСервере(Услуга, НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура НагрузкаУслугаПриИзмененииНаСервере(Услуга, НомерСтроки)
		
	ЗаполняемаяТаблица = Объект.Нагрузки;
	МассивСтрок = ЗаполняемаяТаблица.НайтиСтроки(новый Структура("Услуга",Услуга));
	


	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("услуга", Услуга);
	Запрос.УстановитьПараметр("Период",					Объект.Дата);
	Запрос.УстановитьПараметр("Организация",			Объект.Организация);
	Запрос.УстановитьПараметр("Район",					Объект.Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",			Объект.ОбъектРасчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	               |ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	               |ИЗ
	               |	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	               |ГДЕ
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	               |	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	               |ПОМЕСТИТЬ АктивныеТочкиУслуги
	               |ИЗ
	               |	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета
	               |					И ТочкаУчета В
	               |						(ВЫБРАТЬ
	               |							АктивныеТочкиУчетаОбъекта.ТочкаУчета
	               |						ИЗ
	               |							АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	               |		ПО АктивныеТочкиУчетаОбъекта.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	               |			И АктивныеТочкиУчетаОбъекта.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктивныеТочкиУслуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	АктивныеТочкиУслуги.ТочкаУчета КАК ТочкаУчета,
	               |	ВЫБОР
	               |		КОГДА АктивныеТочкиУслуги.Услуга.СоставнаяУслуга
	               |			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	               |		ИНАЧЕ АктивныеТочкиУслуги.Услуга
	               |	КОНЕЦ КАК Услуга
	               |ПОМЕСТИТЬ ВТ_ТочкиИУслуги
	               |ИЗ
	               |	АктивныеТочкиУслуги КАК АктивныеТочкиУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	               |		ПО АктивныеТочкиУслуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестНагрузкаПоУслугамНПСрезПоследних.ВидНагрузки КАК ВидНагрузкиДо,
	               |	бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка КАК НагрузкаДо,
	               |	ВТ_ТочкиИУслуги.Услуга КАК Услуга,
	               |	ВТ_ТочкиИУслуги.ОбъектРасчета КАК ОбъектРасчета
	               |ИЗ
	               |	ВТ_ТочкиИУслуги КАК ВТ_ТочкиИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета) КАК бестНагрузкаПоУслугамНПСрезПоследних
	               |		ПО ВТ_ТочкиИУслуги.Услуга = бестНагрузкаПоУслугамНПСрезПоследних.Услуга
	               |ГДЕ
	               |	ВТ_ТочкиИУслуги.Услуга = &Услуга
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТочкиИУслуги.Услуга,
	               |	бестНагрузкаПоУслугамНПСрезПоследних.ВидНагрузки,
	               |	бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка,
	               |	ВТ_ТочкиИУслуги.ОбъектРасчета";
	Результат  = Запрос.Выполнить();
	
	Если не Результат.Пустой() Тогда
		Для Каждого ТекСтр из МассивСтрок  Цикл
			ЗаполняемаяТаблица.Удалить(ТекСтр);
		КонецЦикла;
		
	Выборка = Результат.Выбрать();
	
	Пока  Выборка.Следующий() Цикл 
		Новаястрока =  ЗаполняемаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(Новаястрока, Выборка);	
	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НагрузкаВидНагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка.ТекущиеДанные;
	
	Если ТекДанные.ВидНагрузки = ТекДанные.ВидНагрузкиДО Тогда 
		ТекДанные.ВидНагрузки = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид нагрузки не изменился");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НагрузкаНагрузкаПриИзменении(Элемент)
	ТекДанные = Элементы.Нагрузка.ТекущиеДанные;
	
	Если ТекДанные.нагрузка = ТекДанные.нагрузкаДО Тогда 
		 ТекДанные.нагрузка = Неопределено;
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нагрузка не изменилась");
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьНагрузкуПоУслугам(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры
